Revit 2017 API
RebarConstraintsManager.GetPreferredConstraintOnHandle Method
 Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public RebarConstraint GetPreferredConstraintOnHandle(
	RebarConstrainedHandle handle
)
Visual Basic
Public Function GetPreferredConstraintOnHandle ( _
	handle As RebarConstrainedHandle _
) As RebarConstraint
Visual C++
public:
RebarConstraint^ GetPreferredConstraintOnHandle(
	RebarConstrainedHandle^ handle
)
Parameters
handle
Type: Autodesk.Revit.DB.Structure.RebarConstrainedHandle
 The RebarConstrainedHandle for which the user RebarConstraint is to be returned.
Return Value
 The user prefered RebarConstraint applied to the RebarConstrainedHandle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  handle is no longer valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace